Repository: italabs/ITA.Common
Catalog: SOURCE/ITA.Common.Host/Events.*.resx
Languages: ru

# ITA.Common.Events.OnAC
source: &1000;Switching to AC power
ru: &1000;Переключение на питание от сети

# ITA.Common.Events.OnBattery
source: &1002;Switching to battery power
ru: &1002;Переключение на питание от аккумулятора

# ITA.Common.Events.OnBatteryLow
source: &1003;Battery power is low
ru: &1003;Низкий уровень заряда аккумулятора

# ITA.Common.Events.OnContinued
source: &1004;{0} v{1} is resumed from paused state
ru: &1004;{0} v{1} восстановлен после паузы

# ITA.Common.Events.OnContinuing
source: &1005;{0} v{1} is resuming from paused state
ru: &1005;{0} v{1} восстанавливается после паузы

# ITA.Common.Events.OnError
source: &1006;Error has occurred: {0}
ru: &1006;Произошла ошибка: {0}

# ITA.Common.Events.OnPaused
source: &1007;{0} v{1} is paused
ru: &1007;{0} v{1} поставлен на паузу

# ITA.Common.Events.OnPausing
source: &1008;{0} v{1} is pausing
ru: &1008;{0} v{1} ставится на паузу

# ITA.Common.Events.OnQuerySuspendDenied
source: &1009;Suspend request is declined due to current configuration
ru: &1009;Запрос на переход в ждущий/спящий режим был отклонен в соответствии с текущей конфигурацией

# ITA.Common.Events.OnResumeAutomatic
source: &1010;Resuming from suspended state. Restoring {0} state
ru: &1010;Восстановление из ждущего/спящего режима. Переход в состояние {0}

# ITA.Common.Events.OnResumeCritical
source: &1011;Resuming from critical suspended state. Restoring {0} state
ru: &1011;Восстановление после критического перехода в ждущий режим. Переход в состояние {0}

# ITA.Common.Events.OnStarted
source: &1012;{0} v{1} is started
ru: &1012;{0} v{1} запущен

# ITA.Common.Events.OnStarting
source: &1013;{0} v{1} is starting
ru: &1013;{0} v{1} запускается

# ITA.Common.Events.OnStopped
source: &1014;{0} v{1} is stopped
ru: &1014;{0} v{1} остановлен

# ITA.Common.Events.OnStopping
source: &1015;{0} v{1} is stopping
ru: &1015;{0} v{1} останавливается

# ITA.Common.Events.OnSuspend
source: &1016;Suspend request is accepted, initiating state transition
ru: &1016;Запрос на переход в ждущий/спящий режим подтвержден. Инициирован переход в соответствующее состояние

# ITA.Common.Events.Host.ConfigManager.OnConfigurationChanged
source: &1030;Configuration of component '{0}' has been changed. Parameter is: '{1}'. Old value is: '{2}'. New value is: '{3}'.
ru: &1030;Изменилась конфигурация компонента '{0}'. Параметр: '{1}'. Предыдущее значение: '{2}'. Новое значение: '{3}'.

# ITA.Common.Events.OnInitialized
source: &1018;{0} v{1} is initialized
ru: &1018;{0} v{1} инициализирован

# ITA.Common.Events.OnInitializing
source: &1017;{0} v{1} is initializing
ru: &1017;{0} v{1} инициализируется

# ITA.Common.Events.OnShutDown
source: &1020;{0} v{1} is shut down
ru: &1020;{0} v{1} выключен

# ITA.Common.Events.OnShuttingDown
source: &1019;{0} v{1} is shutting down
ru: &1019;{0} v{1} выключается
