Repository: italabs/ITA.Common
Catalog: SOURCE/ITA.Wizards/Messages.*.resx
Languages: ru

# WIZ_SELECT_WIZARD_MODE_DESC2
source: The wizard will gather the necessary information, create a new database, initialize it and configure the product to use.
ru: Мастер соберет необходимую информацию, создаст новую базу данных, проинициализирует ее и настроит продукт на ее использование.

# WIZ_SELECT_WIZARD_MODE_DESC3
source: The wizard allows you to configure the product to use an existing database.
ru: Мастер позволит настроить продукт на использование существующей базы данных.

# WIZ_DB_PROVIDER
source: Database provider
ru: Провайдер базы данных

# WIZ_SELECT_DB_PROVIDER
source: Select the database provider
ru: Выберите провайдер базы данных

# WIZ_CONFIG_PARAMETERS_HAVE_ERRORS
source: Initialization parameters contain errors:
ru: Параметры инициализации содержат ошибки:

# WIZ_AUTO_MODE_STARTED
source: Automode is launched ...
ru: Авторазвертывание запущенно...

# WIZ_AUTO_MODE_COMPLETED
source: Automode is completed.
ru: Авторазвертывание завершено.

# WIZ_AUTO_MODE_ERROR
source: Error of automode:
ru: Ошибка режима авторазвертывания:

# WIZ_AUTO_MODE_INIT_ERROR
source: An error occurred reading initialization parameters:
ru: Произошла ошибка считывания параметров инициализации:

# WIZ_NO_UPDATE_RULES
source: There is no list of rules that update the database. Download the rules by using the LoadRules method.
ru: Отсутствует список правил обновления базы данных. Загрузите правила с помощью метода LoadRules.

# WIZ_BACKUP
source: Backing up a database
ru: Резервное копирование базы данных

# WIZ_NEED_BACKUP
source: You must back up the existing database
ru: Необходимо выполнить резервное копирование существующей базы данных

# WIZ_NEED_BACKUP_MESSAGE
source: Before you upgrade the database, be sure to back up your existing version of the database.
ru: Перед началом обновления базы данных следует ОБЯЗАТЕЛЬНО выполнить резервное копирование существующей версии базы данных.

# WIZ_BACKUP_CONFIRM
source: Confirm that before updating the database has been backed up
ru: Подтверждаю, что перед обновлением базы данных было выполнено резервное копирование

# WIZ_CONFIRM_BACKUP_IS_ACTUAL
source: Confirm that a backup copy is relevant
ru: Подтверждаю, что сделанная резервная копия является актуальной

# WIZ_DB_UPDATING
source: Updating the database
ru: Обновление базы данных

# WIZ_DB_IS_UPDATED
source: The database was successfully updated
ru: База данных была успешно обновлена

# WIZ_DB_IS_UPDATED_TO_VERSION
source: The database was successfully updated to version:
ru: База данных была успешно обновлена до версии:

# WIZ_DB_NEED_TO_BE_UPDATED
source: To continue the server configuration the selected database needs to be updated to the next version:
ru: Для продолжения настройки сервера требуется выполнить обновление выбранной базы данных до актуальной версии:

# WIZ_DB_VERSION_CURRENT
source: Version of the current database:
ru: Версия текущей базы данных:

# WIZ_DB_VERSION_ACTUAL
source: Version required for work:
ru: Версия, требуемая для работы:

# WIZ_NEED_BACKUP_DESCRIPTION
source: Before you upgrade the database, be sure to back up your existing version of the database.
ru: Перед началом обновления базы данных следует ОБЯЗАТЕЛЬНО выполнить резервное копирование существующей версии базы данных.

# WIZ_DB_CURRENT_NAME
source: The name of the current database:
ru: Имя текущей базы данных:

# WIZ_WAIT_UPDATING_COMPLETE
source: Please wait while database updates
ru: Дождитесь завершения обновления базы данных

# WIZ_UPDATING_PROGRESS
source: Execution progress:
ru: Прогресс выполнения:

# WIZ_DB_TITLE
source: Database wizard
ru: Мастер подключения к базе данных

# WIZ_MYSQL_CHECK_CONNECTION
source: &Test connection
ru: &Проверка соединения

# WIZ_MYSQL_CONNECTING
source: Connection
ru: Подключение

# WIZ_MYSQL_CONNECTION
source: Connecting to MySql
ru: Подключение к MySql

# WIZ_MYSQL_CREATE_NEW_USER
source: &Create a new user
ru: &Создать нового пользователя

# WIZ_MYSQL_ENTER_ADMIN_USER_NAME
source: Specify a user with administrative rights:
ru: Укажите пользователя с административными правами:

# WIZ_MYSQL_ENTER_PORT
source: Enter the port of the database server:
ru: Введите порт сервера БД:

# WIZ_MYSQL_ENTER_SERVER_NAME
source: Type the name of the server:
ru: Введите имя сервера:

# WIZ_MYSQL_ENTER_SID
source: Enter the SID of the database:
ru: Введите SID БД:

# WIZ_MYSQL_NEED_ENTER_PASSWORD
source: You must enter a password
ru: Необходимо ввести пароль

# WIZ_MYSQL_PASSWORD
source: Password:
ru: Пароль:

# WIZ_MYSQL_PASSWORD_IS_NOT_PROVIDED
source: Password is not specified
ru: Не указан пароль

# WIZ_MYSQL_SELECT_SCHEME
source: Select database scheme
ru: Выберите схему базы данных:

# WIZ_MYSQL_SELECT_SERVER
source: Select the MySql server and specify connection parameters for the administrator
ru: Выберите сервер MySql и укажите парметры подключения для администратора

# WIZ_MYSQL_SELECT_USER_SETTINGS
source: Specify the user settings that will be used to connect to the database
ru: Укажите параметры пользователя, который будет использоваться для подключения к базе данных

# WIZ_MYSQL_SETTINGS_DESCRIPTION
source: User supplied parameters will be used for server connection and will be assigned to the selected database
ru: Предоставленные параметры пользователя будут использоваться для серверного подключение и будут сопоставленны с выбранной базой данных

# WIZ_MYSQL_SET_SCHEME_NAME
source: Please specify the name of the database schema:
ru: Пожалуйста, задайте имя &схемы базы данных:

# WIZ_MYSQL_USER_NAME
source: &User name:
ru: &Имя пользователя:

# WIZ_MYSQL_USER_NAME_LABEL
source: User name:
ru: Имя пользователя:

# WIZ_MYSQL_USER_SETTINGS
source: User settings
ru: Настойки пользователя

# WIZ_SRV_NO_CREATE_DB_PERMISSION
source: The selected user has no administrative rights that is required to create the database. Grant the user 'CREATE ANY DATABASE' permission.
ru: Выбранный пользователь не имеет административных прав, необходимых для создания базы данных. Предоставьте пользователю разрешение 'CREATE ANY DATABASE'.

# WIZ_SRV_NO_CREATE_LOGIN_PERMISSION
source: The selected user has no administrative rights that is required to create the SQL Server login. Grant the user 'ALTER ANY LOGIN' permission.
ru: Выбранный пользователь не имеет административных прав, необходимых для создания входа в SQL Server. Предоставьте пользователю разрешение 'ALTER ANY LOGIN'.

# WIZ_AZURE_SQL_CHECK_CONNECTION
source: &Test connection
ru: &Проверка соединения

# WIZ_AZURE_SQL_CONNECTING
source: Connection
ru: Подключение

# WIZ_AZURE_SQL_CONNECTION
source: Connecting to Azure SQL
ru: Подключение к Azure SQL

# WIZ_AZURE_SQL_CREATE_NEW_USER
source: &Create a new user
ru: &Создать нового пользователя

# WIZ_AZURE_SQL_ENTER_DB_NAME
source: Database name:
ru: Имя базы данных:

# WIZ_AZURE_SQL_ENTER_SERVER_NAME
source: Server name:
ru: Имя сервера:

# WIZ_AZURE_SQL_ENTER_SID
source: Enter the SID of the database:
ru: Введите SID БД:

# WIZ_AZURE_SQL_NEED_ENTER_PASSWORD
source: You must enter a password
ru: Необходимо ввести пароль

# WIZ_AZURE_SQL_PASSWORD
source: Password:
ru: Пароль:

# WIZ_AZURE_SQL_PASSWORD_IS_NOT_PROVIDED
source: Password is not specified
ru: Не указан пароль

# WIZ_AZURE_SQL_SELECT_SCHEME
source: Select database scheme
ru: Выберите схему базы данных:

# WIZ_AZURE_SQL_SELECT_SERVER
source: Select the Azure SQL server and specify connection parameters for the administrator
ru: Выберите сервер Azure SQL и укажите парметры подключения для администратора

# WIZ_AZURE_SQL_SELECT_USER_SETTINGS
source: Specify the user settings that will be used to connect to the database
ru: Укажите параметры пользователя, который будет использоваться для подключения к базе данных

# WIZ_AZURE_SQL_SETTINGS_DESCRIPTION
source: User supplied parameters will be used for server connection and will be assigned to the selected database
ru: Предоставленные параметры пользователя будут использоваться для серверного подключение и будут сопоставленны с выбранной базой данных

# WIZ_AZURE_SQL_SET_SCHEME_NAME
source: Please specify the name of the database schema:
ru: Пожалуйста, задайте имя &схемы базы данных:

# WIZ_AZURE_SQL_USER_NAME
source: &User name:
ru: &Имя пользователя:

# WIZ_AZURE_SQL_USER_NAME_LABEL
source: User name:
ru: Имя пользователя:

# WIZ_AZURE_SQL_USER_SETTINGS
source: User settings
ru: Настойки пользователя

# WIZ_AZURE_SQL_DENY_FOR_DB_CREATION
source: The database contains data. New database creation is denied.
ru: База данных содержит данные. Создание новой базы данных запрещено.

# WIZ_AZURE_SQL_CREDENTIAL_TYPE_NOT_SUPPORTED
source: Database credentials type '{0}' is not supported.
ru: Тип учетных данных '{0}' не поддерживатся.
