Repository: italabs/ITA.Common
Catalog: SOURCE/ITA.Wizards/Messages.*.resx
Languages: ru

# WIZ_SRV_LOGIN_SUCCEEDED
source: Connection to the server has been successfully performed.
ru: Соединение с сервером успешно установлено.

# WIZ_DB_ENTER_USER
source: User login is not specified
ru: Не указан логин пользователя

# WIZ_AD_SID_IS_NULL
source: The current user is not defined
ru: Текущий пользователь не определен

# WIZ_AD_SELECT_CONTAINER
source: You must select the Active Directory container object
ru: Необходимо выбрать объект-контейнер Active Directory

# WIZ_DB_ALREADY_EXISTS
source: Database {0} already exists. Enter a different name
ru: База данных {0} уже существует. Введите другое имя

# WIZ_DB_ENTER_PASSWORD
source: The password must contain at least 8 and not more than 80 characters, and also contain uppercase/lowercase letters and numbers
ru: Пароль должен содержать не менее 8 и не более 80 символов, а также содержать символы верхнего/нижнего регистра и цифры

# WIZ_SRV_LOGIN_FAILED
source: Unable to connect to {0}.
ru: Невозможно подключиться к {0}.

# WIZ_DB_RECONFIRM_PASSWORD
source: The passwords entered do not match
ru: Введенные пароли не совпадают

# WIZ_AD_SID_NOT_FOUND
source: Current user {0} does not belong to the specified container {1}. Select a different container objects
ru: Текущий пользователь {0} не принадлежит указанному контейнеру {1}. Выберете другой контейнер объектов

# WIZ_DB_LOGIN_FAILED
source: Cannot connect to the DATABASE {0} user {1}.
ru: Невозможно подключиться к серверу БД {0} пользователю {1}.

# WIZ_INVALID_DATABASE
source: Incorrect database or you do not have access.
ru: Неверная база данных или отсутствует доступ.

# WIZ_INVALID_CONNECTION_STRING
source: Could not open a connection to the database. Check the connection string.
ru: Невозможно открыть соединение с БД. Проверьте строку подключения.

# WIZ_CAPTION_CONNECT
source: {0}-connect to a database
ru: {0} - Подключиться к базе данных

# WIZ_DB_SELECT_DB
source: No database is selected.
ru: Не выбрана база данных.

# WIZ_DB_USER_ALREADY_EXISTS
source: The specified login {0} already exists. Enter a different name.
ru: Указанный логин {0} уже существует. Введите другое имя.

# WIZ_CAPTION_CREATE
source: {0}-create a database
ru: {0} - Создать базу данных

# WIZ_DB_ENTER_DB
source: Database name not specified
ru: Не указано имя базы данных

# WIZ_SRV_SELECT
source: Do not specify a database server
ru: Не указан сервер базы данных

# WIZ_DB_PASSWORD_NO_DIGIT
source: Password must include numbers
ru: Пароль должен содержать цифры

# WIZ_DB_PASSWORD_NO_LOWER
source: The password must contain characters in lowercase
ru: Пароль должен содержать символы в нижнем регистре

# WIZ_DB_PASSWORD_NO_SPECIAL
source: The password must contain special characters
ru: Пароль должен содержать специальные символы

# WIZ_DB_PASSWORD_NO_UPPER
source: The password must contain uppercase characters
ru: Пароль должен содержать символы в верхнем регистре

# WIZ_DB_PASSWORD_TOO_SHORT
source: The password must contain at least {0} characters
ru: Пароль должен содержать не менее {0} символов

# WIZ_DB_INVALID_DATABASE_NAME
source: Valid characters: A-Z, a-z, 0-9 and _
ru: Допустимые символы: A-Z,А-Я,0-9 и _

# WIZ_DB_INVALID_LOGIN
source: Valid characters: A-Z, a-z, 0-9 and _
ru: Допустимые символы: A-Z,А-Я,0-9 и _

# WIZ_DB_INVALID_DATABASE_NAME_EXT
source: Invalid database name. In the name of the only characters, numbers and underscores
ru: Недопустимое имя базы данных. В имени разрешены только символы алфавита, цифры и знак подчеркивания

# WIZ_DB_INVALID_LOGIN_EXT
source: Invalid user login. The name can contain only characters, numbers and underscores
ru: Недопустимый логин пользователя. В имени разрешены только символы алфавита, цифры и знак подчеркивания

# WIZ_DB_WIZ_INVALID_PASSWORD_SYMBOLS
source: Password should not contain [or]
ru: Пароль не должен содержать символы [ или ]

# WIZ_SRV_DB_USER_IS_NOT_ADMIN
source: The selected user has no administrative rights that is required to create the database. Add the user to the Server sysadmin group.
ru: Выбранный пользователь не обладает административными правами, требуемыми для создания базы данных. Добавьте пользователя в серверную группу sysadmin.

# WIZ_SRV_WINDOWS_USER_IS_NOT_ADMIN
source: The current Windows user does not have administrative rights required to create the database. Add the user to the Server sysadmin group.
ru: Текущий пользователь Windows не обладает административными правами, требуемыми для создания базы данных. Добавьте пользователя в серверную группу sysadmin.

# WIZ_DB_GRANT_PERMISSION_ERROR
source: An error occurred while granting rights to the current user to have access to an existing database. After Setup completes, you must configure the service access to the database manually, or restart the wizard database connection under a user account with rights of securityadmin.
ru: Ошибка при предоставлении прав текущему пользователю на доступ к существующей базе данных. После завершения установки необходимо сконфигурировать доступ сервиса к базе данных в ручном режиме, либо перезапустите мастер соединения с базой данных под учетной записью пользователя, обладающего правами securityadmin.

# WIZ_SRV_INVALID_DB_PERMISSIONS
source: You do not have sufficient permissions
ru: Отсутствуют необходимые разрешения

# WIZ_DB_PASSWORD_TOO_LONG
source: The password must not contain more than {0} characters
ru: Пароль должен содержать не более {0} символов

# WIZ_DB_ENTER_EXISTS_PASSWORD
source: The password must contain at least 8 and not more than 80 characters
ru: Пароль должен содержать не менее 8 и не более 80 символов

# I_ITA_SERVER_RESTART_WARNING
source: Launching Wizard will restart the management server. Do you Want To Continue?
ru: Запуск мастера первоначальной настройки продукта приведет к перезапуску сервера управления. Продолжить?

# E_ITA_UPDATE_INVALID_SCRIPT
source: Failed to read the database upgrade script resource.
ru: Не удалось прочитать сценарий обновления базы данных из ресурсов.

# E_ITA_DB_HAS_OLD_VERSION
source: Current database version {0} is not supported by the server. The required version is {1}.
ru: Текущая версия базы данных ({0}) не поддерживается сервером. Требуется версия БД - {1}.

# E_ITA_UPDATE_INVALID_DATABASE
source: Unable to determine the version of the database. The database has an incorrect structure.
ru: Не удалось определить версию базы данных. Возможно, база данных имеет неверную структуру .

# E_ITA_UPDATE_UNKNOWN_VERSION
source: Unable to determine the version of the database.
ru: Не удалось определить версию базы данных.

# E_ITA_UPDATE_OLD_VERSION
source: Current version {0} cannot be updated. The minimum supported version is {1}.
ru: Обновление текущей версии {0} невозможно. Минимально поддерживаемой модулем обновления версией является {1}.

# E_ITA_UPDATE_UNSUPPORTED_VERSION
source: Upgrading your current version of the database is not supported.
ru: Обновление текущей версии базы данных не поддерживается.

# E_ITA_UPDATE_UNSUPPORTED_ACTION
source: Unsupported type of update activity.
ru: Неподдерживаемый тип действия по обновлению.

# E_ITA_UPDATE_NO_CUSTOM_STEP
source: Does not implement interface ICustomUpdateStep.
ru: Не реализован интерфейс ICustomUpdateStep.

# I_ITA_FINISHED
source: Successfully completed
ru: Успешно завершено

# E_ITA_ERROR
source: Error
ru: Ошибка

# E_ITA_UPDATE_FATAL_ERROR
source: Fatal error when upgrading a database.
ru: Критическая ошибка при обновлении базы данных.

# E_ITA_FINISHED_WITH_ERRORS
source: Completed with errors
ru: Завершено с ошибками

# I_ITA_RESULT_WAIT
source: Waiting for the result ...
ru: Ожидание результата...

# I_ITA_DATABASE_IS_ACTUAL
source: The database is up-to-date
ru: База данных имеет актуальную версию

# I_ITA_DATABASE_IS_NOT_ACTUAL
source: You must upgrade the database
ru: Необходимо выполнить обновление базы данных

# E_ITA_DATABASE_IS_UNAVAILABLE
source: The database is unavailable or has unsupported version
ru: База данных недоступна или ее версия не поддерживается

# E_ITA_DATABASE_VERSION_ERROR
source: An error has occurred while validating the database
ru: Ошибка при проверке базы данных

# E_ITA_USER_ACCESS_ERROR
source: User rights validation error
ru: Ошибка проверки прав пользователя

# I_ITA_THANKS
source: Thank you!
ru: Спасибо!

# I_ITA_DATABASE_WELCOME
source: Welcome to the database connection Wizard
ru: Вас приветствует Мастер подключения к базе данных

# I_ITA_DATABASE_INFO
source: This wizard helps you configure a connection to a new or existing database server.
ru: Мастер помогает настроить подключение к новой или существующей базе данных сервера.

# E_ITA_DATABASE_VALIDATION_FAILED
source: An error occurred while determining the type of database server
ru: Ошибка при определении типа сервера базы данных

# E_ITA_DATABASE_UNKNOWN_USER
source: Error occurred while looking up the user's SID
ru: Ошибка при поиске пользователя по SID

# E_DBWIZARD_LIST_DB_ERROR
source: Failed to retrieve list of databases and users from a database server.
ru: Ошибка получения списка баз данных и пользователей с сервера баз данных.

# E_ITA_INITIAL_WIZARD_DATABASE_UPDATE_ERROR
source: Fatal error when upgrading a database.
ru: Критическая ошибка при обновлении базы данных.

# E_DBWIZARD_DATABASE_SETUP_FAILED
source: Error creating database.
ru: Ошибка при создании базы данных.

# I_SERVER_STATUS_RUNNING_BALLOON
source: The server is running.
ru: Сервер запущен.

# E_DBWIZARD_ERROR
source: Wizard database connection settings internal error.
ru: Внутренняя ошибка мастера настройки соединения с базой данных.

# E_DBWIZARD_LIST_SERVERS
source: Error getting list of available database servers.
ru: Ошибка получения списка доступных серверов баз данных.

# E_ITA_UNHANDLED_EXCEPTION
source: An unexpected error occurred.
ru: Произошла неожиданная ошибка.

# E_ITA_OPEN_EVENTLOG
source: Unable to open the event log.
ru: Не удалось открыть "Журнал событий".

# WIZ_SRV_DB_PROVIDER_IS_NOT_AVAILABLE
source: The selected database provider ({0}) is not available. Select a different provider type.
ru: Выбранный провайдер базы данных ({0}) недоступен. Выберите другой тип провайдера.

# WIZ_SELECT_DB_WIN_AUTH_SERVER_CAPTION
source: Checking Windows authentication for database server.
ru: Проверка Windows-аутентификации для сервера БД.

# WIZ_SELECT_DB_WIN_AUTH_SERVER_MESSAGE
source: Wizard successfully checked database availability for user '{0}'. If the configuration is made for a service running under a different account, you may need to manually grant access to the database for the service account.
ru: Мастер развертывания успешно проверил доступность базы данных для пользователя '{0}'. Если настройка производится для службы, работающей под другой учетной записью, то после завершения конфигурирования может потребоваться ручное предоставление доступа к БД для сервисной учетной записи.

# WIZ_SUCCESS_UPDATE
source: Database successfully upgrated to version {0}
ru: База данных успешно оновлена до версии {0}

# WIZ_DB_DOESNT_NEED_UPDATE
source: Database does not need to be upgrated.
ru: База не нуждается в обновлении.

# WIZ_USAGE_MESSAGE_TEMPLATE
source: Example usage: {0} [[[/<key>=<value>] /<key>=<value>] ...] <key>and <value>, where it is: UnattendedMode-Specifies whether to run wizard in unattended mode. Its values: true, false. Default value: false. If false or omitted, then the deployment wizard will be initialized by the rest of the passed values. If true, the deployment wizard will be launched in unattended mode. DbProviderType-provider type in the database. Its values: {1}. default value: {2} Settings common to all providers of DB: ServerName-the name of the database server. Default value is undefined. ServerLogin-the user name for the administrative connection. Default value is undefined. ServerPassword-user password for the administrative connection. Default value is undefined. DatabaseName is the name of the database. Default value is undefined. DatabaseLogin-the user name to connect to the database. Default value is undefined. -DatabasePassword password to connect to the database. Default value is undefined. CreateNewDatabase is a sign of the need to create a new database. Its values: true, false. Default value: false. CreateNewDatabaseLogin-sign of the need to create a new database user. Its values: true, false. Default value: false. ConnectionString-storoka connect to the database. Default value is undefined. If the value is set, it will be used as the current configuration. Settings for DB provider type {3} ServerCredentialType-type administrative connection to a SQL Server database. Its values: {4}. default value: {5} DatabaseCredentialType-type of user connection to a SQL Server database. Its values: {6}. default value: {7} Settings for DB provider type {8} ServerDatabasePort-the port number that is used to connect to an Oracle database. Its values are: 0-65535. The default value is 1521. ServerDatabaseSID-SID of the Oracle database. Default value is undefined. Sample run in mode avtorazvertyvaniâ: {9}/UnattendedMode = true/DbProviderType = MSSQL:/ServerName .\sqlexpress/ServerCredentialType = NT/CreateNewDatabase = true/DatabaseName = DemoWizardDb</value> </key> /DatabaseCredentialType</value> = NT</key> </value> </key>
ru: Пример использования: {0} [[[/<key>=<value>] /<key>=<value>] ...] , где <key> и <value> это: UnattendedMode - признак запуска визарда в автоматическом режиме. Его значения:true, false. Значение по-умолчанию:false. Если значение false или опущено, то мастер развертывания будет проинициализирован остальными переданными значениями. Если значение равно true, то мастер развертывания будет запущен в режиме авторазвертывания. DbProviderType - тип провайдера базы данных. Его значения:{1}. Значение по-умолчанию:{2} Параметры, общие для всех провайдеров БД: ServerName - имя сервера базы данных. Значение по-умолчанию не определено. ServerLogin - имя пользователя для административного подключения. Значение по-умолчанию не определено. ServerPassword - пароль пользователя для административного подключения. Значение по-умолчанию не определено. DatabaseName - имя базы данных. Значение по-умолчанию не определено. DatabaseLogin - имя пользователя для подключения к базе данных. Значение по-умолчанию не определено. DatabasePassword - пароль пользователя для подключения к базе данных. Значение по-умолчанию не определено. CreateNewDatabase - признак необходимости создания новой базы данных. Его значения:true, false. Значение по-умолчанию:false. CreateNewDatabaseLogin - признак необходимости создания нового пользователя базы данных. Его значения:true, false. Значение по-умолчанию:false. ConnectionString - сторока подключения к базе данных. Значение по-умолчанию не определено. Если значение задано, то оно будет использоваться как существующая конфигурация. Параметры для провайдера БД типа {3} ServerCredentialType - тип административного подключения к базе данных SQL Server. Его значения:{4}. Значение по-умолчанию:{5} DatabaseCredentialType - тип пользовательского подключения к базе данных SQL Server. Его значения:{6}. Значение по-умолчанию:{7} Параметры для провайдера БД типа {8} ServerDatabasePort - номер порта, который будет использоваться для подключения к серверу базы данных Oracle. Его значения:0-65535. Значение по-умолчанию 1521. ServerDatabaseSID - SID базы данных Oracle. Значение по-умолчанию не определено. Пример запуска в режиме авторазвертывания: {9} /UnattendedMode=true /DbProviderType=MSSQL /ServerName:.\sqlexpress /ServerCredentialType=NT /CreateNewDatabase=true /DatabaseName=DemoWizardDb /DatabaseCredentialType=NT

# WIZ_PARAMETER_VALIDATION_ERROR
source: Parameter ' {0} ' is not specified.
ru: Параметр '{0}' не задан.

# WIZ_SELECT_DB_MESSAGE
source: Select database
ru: Выбор базы данных

# WIZ_SQL_SELECT_DB_AND_SETTINGS
source: Specify the database connection settings
ru: Укажите базу данных и настройки подключения

# WIZ_SQL_SELECT_DB_NAME
source: Specify the database name
ru: Укажите имя БД

# WIZ_SQL_PASSWORD
source: &Password:
ru: &Пароль:

# WIZ_SQL_PASSWORD_CONFIRM
source: Co&nfirm password:
ru: По&дтверждение пароля:

# WIZ_SQL_CONNECTION_SETTINGS
source: Configuring Server connection to DB
ru: Настройки подключения сервера к БД

# WIZ_SQL_AUTH_MODE
source: Specify the authentication method
ru: Укажите способ проверки подлинности

# WIZ_SQL_AUTH
source: &SQL Server
ru: Средствами &SQL Server

# WIZ_SQL_NT_AUTH
source: &Windows NT
ru: Средствами &Windows

# WIZ_SQL_USE_SSL
source: Secure connection
ru: Защищенное соединение

# WIZ_SRV_SSL_FAILED
source: Failed to establish a secure SSL-connection.
ru: Не удалось установить защищенное SSL-соединение.

# WIZ_SQL_CREATE_NEW_LOGIN
source: &Create a new login
ru: &Создать новый логин

# WIZ_SQL_LOGIN
source: &Login:
ru: &Логин:

# WIZ_SQL_CANNOT_VALIDATE_USER
source: It is impossible to check permissions for ' {0} '.
ru: Невозможно выполнить проверку доступуа для '{0}'.

# WIZ_SQL_NEED_ENTER_PASSWORD
source: You must enter a password
ru: Необходимо ввести пароль

# WIZ_ORACLE_NEED_ENTER_PASSWORD
source: You must enter a password
ru: Необходимо ввести пароль

# WIZ_ORACLE_CREATE_NEW_USER
source: &Create a new user
ru: &Создать нового пользователя

# WIZ_ORACLE_SELECT_SCHEME
source: Select database scheme
ru: Выберите схему базы данных:

# WIZ_ORACLE_USER_SETTINGS
source: User settings
ru: Настойки пользователя

# WIZ_ORACLE_USER_NAME
source: &User name:
ru: &Имя пользователя:

# WIZ_ORACLE_SELECT_USER_SETTINGS
source: Specify the user settings that will be used to connect to the database
ru: Укажите параметры пользователя, который будет использоваться для подключения к базе данных

# WIZ_ORACLE_SETTINGS_DESCRIPTION
source: User supplied parameters will be used for server connection and will be assigned to the selected database
ru: Предоставленные параметры пользователя будут использоваться для серверного подключение и будут сопоставленны с выбранной базой данных

# WIZ_ORACLE_SET_SCHEME_NAME
source: Please specify the name of the database schema:
ru: Пожалуйста, задайте имя &схемы базы данных:

# WIZ_ORACLE_PASSWORD_IS_NOT_PROVIDED
source: Password is not specified
ru: Не указан пароль

# WIZ_ORACLE_CONNECTION
source: Connecting to Oracle
ru: Подключение к Oracle

# WIZ_ORACLE_SELECT_SERVER
source: Select the Oracle server and specify connection parameters for the administrator
ru: Выберите сервер Oracle и укажите парметры подключения для администратора

# WIZ_ORACLE_CONNECTING
source: Connection
ru: Подключение

# WIZ_ORACLE_USER_NAME_LABEL
source: User name:
ru: Имя пользователя:

# WIZ_ORACLE_ENTER_PORT
source: Enter the port of the database server:
ru: Введите порт сервера БД:

# WIZ_ORACLE_ENTER_SID
source: Enter the SID of the database:
ru: Введите SID БД:

# WIZ_ORACLE_ENTER_SERVER_NAME
source: Type the name of the server:
ru: Введите имя сервера:

# WIZ_ORACLE_CHECK_CONNECTION
source: &Test connection
ru: &Проверка соединения

# WIZ_ORACLE_ENTER_ADMIN_USER_NAME
source: Specify a user with administrative rights:
ru: Укажите пользователя с административными правами:

# WIZ_ORACLE_PASSWORD
source: Password:
ru: Пароль:

# WIZ_SQL_SERVER_SEARCHING
source: Searching for servers ...
ru: Идет поиск серверов...

# WIZ_SQL_SELECTING_CONNECTION_SETTINGS
source: Select connection settings
ru: Выбор настроек подключения

# WIZ_SQL_SET_SERVER_NAME_AND_AUTH_MODE
source: Specify the database server and its authentication
ru: Укажите имя сервера базы данных и способ проверки подлинности при подключении

# WIZ_SELECT_SERVER_NAME
source: Specify the &database server
ru: Укажите &сервер БД

# WIZ_SQL_PROVIDE_AUTH_MODE
source: Specify the authentication method for the administrative connection:
ru: Укажите способ проверки подлинности для административного соединения:

# WIZ_SQL_TEST_CONNECTION
source: &Test connection
ru: &Тест соединения

# WIZ_SQL_CONFIGURING_ADMIIN_CONNECTION
source: Configuring administrative connection
ru: Настройки административного подключения Мастера к БД

# WIZ_SQL_PRESS_FOR_UPDATING_SERVER_LIST
source: Click to refresh the list of servers
ru: Нажмите для обновления списка серверов

# WIZ_SQL_SERVER_LIST_IS_UPDATING
source: The list of servers is updated ...
ru: Список серверов обновляется...

# WIZ_CREATE_NEW_DB
source: Create a new DATABASE
ru: Создание новой БД

# WIZ_CONNECT_TO_EXISTING_DB
source: Connect to an existing DATABASE
ru: Подключение к существующей БД

# WIZ_PARAMETER_CONFIRMATION
source: Confirmation settings
ru: Подтверждение параметров

# WIZ_VALIDATE_PARAMETERS
source: Verify parameters before performing an operation
ru: Проверьте правильность введенных параметров перед выполнением операции

# WIZ_CLICK_NEXT
source: The wizard has collected all the necessary information to configure the database. Click "next" to start the process or the "back" to return to the settings.
ru: Мастером собрана вся необходимая информация для настройки базы данных. Нажмите "Далее" для запуска процесса или "Назад" для возврата к настройкам.

# WIZ_CONNECTION_PARAMETERS
source: Database connection settings
ru: Параметры соединения к базе данных

# WIZ_ACTION
source: Action:
ru: Действие:

# WIZ_SERVER_DB
source: Database Server:
ru: Сервер БД:

# WIZ_DB_NAME
source: Database Name:
ru: Имя БД:

# WIZ_DB_LOGIN
source: Login DB:
ru: Логин БД:

# WIZ_PROVIDER
source: Provider:
ru: Провайдер:

# WIZ_PRODUCT_CONFIGURATION
source: Product configuration
ru: Конфигурация продукта

# WIZ_CONFIG_VALIDATION
source: Checking current configuration
ru: Проверка существующей конфигурации

# WIZ_DB_VALIDATION
source: Checking existing database
ru: Проверка существующей базы данных

# WIZ_VALIDATION_RESULT
source: Validation result
ru: Результат проверки

# WIZ_VALIDATION_RESULT2
source: Test result:
ru: Результат проверки:

# WIZ_DB_CREATING
source: Creating a database
ru: Создание базы данных

# WIZ_PERFORMING_OPERATION
source: Performing operation
ru: Выполнение операции

# WIZ_CREATING_AND_CONFIGURATING
source: You create and configure the server database.
ru: Выполняется создание и настройка базы данных сервера.

# WIZ_CONFIGURATION_SELECTING
source: Select configuration
ru: Выбор конфигурации

# WIZ_SELECTING_CONFIGURATION_MODE
source: Select using mode of an existing configuration
ru: Выбор режима использования существующей конфигурации

# WIZ_USING_EXISTING_CONFIG
source: Use an existing configuration
ru: Использование существующей конфигурации

# WIZ_CREATE_NEW_CONFIG
source: Create a new configuration
ru: Создать новую конфигурацию

# WIZ_SELECT_CONFIG_USING_MODE
source: Select use an existing configuration.
ru: Выберите режим использования существующей конфигурации.

# WIZ_USING_EXISTING_CONFIG_DESCRIPTION
source: The wizard will use an existing configuration to connect to DB
ru: Мастер будет использовать существующую конфигурацию для подключения к БД

# WIZ_NEW_CONFIG_DESCRIPTION
source: The wizard will create a new DB configuration
ru: Мастер позволит создать новую конфигурацию БД

# WIZ_SELECT_WIZARD_MODE
source: Mode selection wizard
ru: Выбор режима работы Мастера

# WIZ_WIZARD_MODE_DESCRIPTION
source: Select the database connection mode
ru: Выбор режима создания базы данных или подключение существующей

# WIZ_CREATE_NEW_DB_MODE
source: Create a new database &
ru: Создание &новой базы данных

# WIZ_CONNECT_TO_DB_MODE
source: Connect to existing database
ru: Подключение к &существующей базе данных

# WIZ_SELECT_WIZARD_MODE_DESC1
source: Specify the Wizard mode - create a new database or connect to existing database.
ru: Укажите режим работы Мастера - создание новой базы данных или настройка подключения к существующей базе данных.
