Repository: italabs/ITA.Common
Catalog: SOURCE/ITA.WizardFramework/Messages.*.resx
Languages: ru

# I_ITA_AGENT_SELECT_FILE
source: Enter a file name or select it using the Browse button
ru: Введите имя файла или выберите его с помощью кнопки Обзор

# I_ITA_AGENT_DIRECTORY_IS_NOT_EXIST
source: The entered directory does not exist
ru: Введенный каталог не существует

# I_ITA_AGENT_MK_EXPORT_WELCOME
source: Welcome to the Export Wizard for master DB key
ru: Вас приветствует мастер экспорта мастер-ключа БД

# I_ITA_AGENT_MK_EXPORT_INFO
source: Export Wizard - Wizard helps to save a backup copy of the master key for the database server.
ru: Мастер экспорта мастер-ключа помогает сохранить резервную копию мастер-ключа базы данных сервера.

# I_ITA_AGENT_THANKS
source: Thank you!
ru: Спасибо!

# E_ITA_AGENT_PASSWORD_IS_SHORT
source: The entered password is too short. The password must be at least 6 characters length.
ru: Введенный пароль слишком короткий. В пароле должно быть не менее 6 символов.

# E_ITA_AGENT_PASSWORD_IS_DIFF
source: The passwords that have been entered do not match
ru: Введенные пароли не совпадают

# I_ITA_BACK
source: < &Back
ru: < &Назад

# I_ITA_NEXT
source: &Next >
ru: &Далее >

# I_ITA_FINISH
source: &Complete
ru: &Завершить

# I_ITA_CANCEL
source: &Cancel
ru: &Отмена
